Revit 2027 API
UpdaterRegistry.DisableUpdater Method
 Disables the updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void DisableUpdater(
	UpdaterId id
)
Public Shared Sub DisableUpdater (
	id As UpdaterId
)
public:
static void DisableUpdater(
	UpdaterId^ id
)
static member DisableUpdater :
        id : UpdaterId -> unit
Parameters
id UpdaterId
 The updater id.
Exceptions
Exception | Condition
ArgumentException |  Updater with this Id is not currently registered in Revit.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UpdaterRegistry Class
Autodesk.Revit.DB Namespace